Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K37.tmx
Source language: en_us
Languages: zh_cn

source: Paper Menagerie
zh_cn: 纸之灵

source: One of my earliest memories starts with me sobbing.
zh_cn: 在我最早的一段记忆里，自己在呜咽着。

source: I refused to be soothed no matter what Mom and Dad tried.
zh_cn: 不论爸爸妈妈怎么哄，我都停不下来。

source: Dad gave up and left the bedroom, but Mom took me into the kitchen and sat me down at the breakfast table.
zh_cn: 爸爸终于没了办法，离开了卧室；妈妈却把我带到厨房，放坐在餐桌旁。

source: "Kan, kan," she said, as she pulled a sheet of wrapping paper from on top of the fridge.
zh_cn: “kàn，kàn 。”她一边说，一边从冰箱顶上抽出一张包装纸。

source: For years, Mom carefully sliced open the wrappings around Christmas gifts and saved them on top of the fridge in a thick stack.
zh_cn: 那些年，妈妈在剪开圣诞礼盒时，都会很小心，然后把包装纸存放在冰箱顶部，到此时已经攒了一大厚叠。

source: She set the paper down, plain side facing up, and began to fold it.
zh_cn: 她把纸压平，内面朝上，开始折叠。

source: I stopped crying and watched her, curious.
zh_cn: 我一下止住了哭，好奇地看着她。

source: She turned the paper over and folded it again.
zh_cn: 她把纸翻过来，又继续折。

source: She pleated, packed, tucked, rolled, and twisted until the paper disappeared between her cupped hands.
zh_cn: 只见她叠、压、塞、卷、搓 ，不一会儿，一张大纸就消失在她拱起的手下 。

source: Then she lifted the folded-up paper packet to her mouth and blew into it, like a balloon.
zh_cn: 随后，她捧起折纸，放到嘴边，像吹气球一样地吹了口气。

source: "Kan," she said. "Laohu."
zh_cn: “kàn，láo hǔ。”

source: She put her hands down on the table and let go.
zh_cn: 她把手放回桌上，让那个小东西下来。

source: A little paper tiger stood on the table, the size of two fists placed together.
zh_cn: 一只小纸老虎蹲坐在桌子上，有两个拳头并排放着那么大。

source: The skin of the tiger was the pattern on the wrapping paper, white background with red candy canes and green Christmas trees.
zh_cn: 从它的外表可以看到包装纸的图案：红色的棒棒糖和绿色的圣诞树间隔排布在白色的背景上。

source: I reached out to Mom's creation.
zh_cn: 我把手伸向妈妈的这个小玩意儿。

source: Its tail twitched, and it pounced playfully at my finger.
zh_cn: 它摇来摇去地晃动着尾巴，朝我的指头扑过来。

source: "Rawrr-sa," it growled, the sound somewhere between a cat and rustling newspapers.
zh_cn: “嗷——萨 。”它低吼了一声，声音大概介于猫叫和报纸摩挲时的沙沙声 。

source: I laughed, startled, and stroked its back with an index finger. The paper tiger vibrated under my finger, purring.
zh_cn: 我欢笑起来，又带着惊奇，用手指抚弄着它的背；它也蹭着我的指头，发出阵阵的咕噜声。

source: "Zhe jiao zhezhi," Mom said.
zh_cn: 妈妈对我说：“zhè jiào zhé zhǐ。”

source: This is called origami.
zh_cn: 这叫折纸。

source: I didn't know this at the time, but Mom's kind was special.
zh_cn: 那时我还不知道折纸是什么，但知道妈妈的折纸很神奇。

source: She breathed into them so that they shared her breath, and thus moved with her life.
zh_cn: 只要她向折好的小东西们吹口气，让它们带上她的呼吸，它们就可以动起来。

source: This was her magic.
zh_cn: 这是妈妈的魔法。

source: Dad had picked Mom out of a catalog.
zh_cn: 爸爸是在一本图册里挑中妈妈的。

source: One time, when I was in high school, I asked Dad about the details.
zh_cn: 有一次——那时我还在上高中—— 我不知第几次地向爸爸询问这件事情的始末。

source: He was trying to get me to speak to Mom again.
zh_cn: 他也再一次地想把我打发走，让我找妈妈问去，但最终还是告诉了我。

source: He had signed up for the introduction service back in the spring of 1973.
zh_cn: 那是1973年的春天，他在介绍所登了记。

source: Flipping through the pages steadily, he had spent no more than a few seconds on each page until he saw the picture of Mom.
zh_cn: 他一页页地浏览着介绍图册，每页都不过几秒钟，直到他看到妈妈的照片 。

source: I've never seen this picture. Dad described it: Mom was sitting in a chair, her side to the camera, wearing a tight green silk cheongsam.
zh_cn: 我从未见过这张照片，爸爸于是给我做了描述：妈妈坐在椅子上，侧身对着镜头，穿着紧身绿色丝质旗袍。

source: Her head was turned to the camera so that her long black hair was draped artfully over her chest and shoulder.
zh_cn: 她看着镜头，一头黑发优雅地垂泻在胸前和肩上。

source: She looked out at him with the eyes of a calm child.
zh_cn: 她的目光透过照片，映入爸爸眼中，安静地像一个孩子。

source: "That was the last page of the catalog I saw," he said.
zh_cn: “那是我看的最后一页。”爸爸说。

source: The catalog said she was eighteen, loved to dance, and spoke good English because she was from Hong Kong.
zh_cn: 图册介绍说，她十八岁，喜爱跳舞；因为来自香港，还说得一口好英语 。

source: None of these facts turned out to be true.
zh_cn: 但后来爸爸发现这些都不是真的。

source: He wrote to her, and the company passed their messages back and forth.
zh_cn: 他开始给她写信，经由介绍所往来信件。

source: Finally, he flew to Hong Kong to meet her.
zh_cn: 终于，他飞去了香港见她。

source: "The people at the company had been writing her responses.
zh_cn: “她的回信都是介绍所的人代写的。

source: She didn't know any English other than 'hello' and 'goodbye.'
zh_cn: 除了‘hello’和‘goodbye’外，她几乎对英语一无所知。”

source: "What kind of woman puts herself into a catalog so that she can be bought?
zh_cn: 究竟是怎样的女人，才会把自己放在一本图册里出卖呢？

source: The high school me thought I knew so much about everything.
zh_cn: 高中时代的我自以为什么都知道得很多。

source: Contempt felt good, like wine.
zh_cn: 轻蔑像杯酒，让人飘飘然。

source: Instead of storming into the office to demand his money back, he paid a waitress at the hotel restaurant to translate for them.
zh_cn: 爸爸并没有冲进介绍所办公室索回中介费，反而还再花钱请酒店餐厅的一个女招待给他们做翻译。

source: "She would look at me, her eyes halfway between scared and hopeful, while I spoke.
zh_cn: “我说话的时候，她看着我，眼里半是恐惧半是希冀。

source: And when the girl began translating what I said, she'd start to smile slowly."
zh_cn: 而当女招待开始把我的话告诉给她听时，她才慢慢地露出了笑容 。”

source: He flew back to Connecticut and began to apply for the papers for her to come to him.
zh_cn: 爸爸飞回康涅狄格，给妈妈办理了各类手续，把她接到自己身边。

source: I was born a year later, in the Year of the Tiger.
zh_cn: 我则在一年后出生，那一年是虎年。

source: At my request, Mom also made a goat, a deer, and a water buffalo out of wrapping paper.
zh_cn: 我要妈妈多折几只，于是她又做了一只山羊，一只小鹿，和一只水牛。

source: They would run around the living room while Laohu chased after them, growling.
zh_cn: 他们绕着客厅跑来跑去，阿虎则追在后面，发出阵阵嘶吼。

source: When he caught them he would press down until the air went out of them and they became just flat, folded-up pieces of paper.
zh_cn: 每次抓到动物，阿虎都会把对方摁住，将其体内的气挤压出来，使之变回一开始那扁扁的折纸。

source: I would then have to blow into them to re-inflate them so they could run around some more.
zh_cn: 而此时我就得给他们吹气，让他们重新膨胀起来，他们就又能继续跑来跑去了。

source: Sometimes, the animals got into trouble.
zh_cn: 动物们有时也会陷入危机。

source: Once, the water buffalo jumped into a dish of soy sauce on the table at dinner.
zh_cn: 有一次，在晚餐桌上，水牛跳进了一碟酱油里。

source: (He wanted to wallow, like a real water buffalo.)
zh_cn: （他想像真正的水牛那样在泥水里打滚。）

source: I picked him out quickly but the capillary action had already pulled the dark liquid high up into his legs.
zh_cn: 我立马把它拎起来，但纸的吸水性还是让浓黑的酱汁高高地浸满了他的四条腿。

source: The sauce-softened legs would not hold him up, and he collapsed onto the table.
zh_cn: 湿软的四肢支撑不住，他只得瘫软在桌上。

source: I dried him out in the sun, but his legs became crooked after that, and he ran around with a limp.
zh_cn: 我把他放到太阳下晒干，但他的腿从此就变得皱巴巴的，只能一跛一拐地跑了。

source: Mom eventually wrapped his legs in saran wrap so that he could wallow to his heart's content (just not in soy sauce).
zh_cn: 最后，妈妈给他腿上包了一层塑料纸，这样他就可以泡到心满意足了（酱油除外）。

source: Also, Laohu liked to pounce at sparrows when he and I played in the backyard.
zh_cn: 还有，阿虎和我在后院玩耍时，总喜欢扑麻雀。

source: But one time, a cornered bird struck back in desperation and tore his ear.
zh_cn: 但有一次，一只被他逼急了的麻雀回过头来啄破了他的耳朵。

source: He whimpered and winced as I held him and Mom patched his ear together with tape.
zh_cn: 他呜咽着，痛苦得脸都缩成一团。我拿住他，看妈妈用胶带粘好了他的耳朵。

source: He avoided birds after that.
zh_cn: 自此之后他就再也不去惹鸟了。

source: And then one day, I saw a TV documentary about sharks and asked Mom for one of my own.
zh_cn: 后来有一天，我看了一部讲鲨鱼的纪录片，就让妈妈折一条纸鲨鱼。

source: She made the shark, but he flapped about on the table unhappily.
zh_cn: 妈妈做好后，鲨鱼在桌上扑棱扑棱地，一脸的不高兴。

source: I filled the sink with water, and put him in. He swam around and around happily.
zh_cn: 我给洗碗池放满水，把鲨鱼放了进去，他就在里面高兴地游了起来。

source: However, after a while he became soggy and translucent, and slowly sank to the bottom, the folds coming undone.
zh_cn: 但是，不一会儿，他就湿透了，变得半透明，慢慢地沉到了池底，折好的地方也逐渐展开。

source: I reached in to rescue him, and all I ended up with was a wet piece of paper.
zh_cn: 我伸下手去想把他救上来，但他还是变成了一张湿透了的纸。

source: Laohu put his front paws together at the edge of the sink and rested his head on them.
zh_cn: 阿虎把前爪搭在洗碗池边，脑袋枕在上面。

source: Ears drooping, he made a low growl in his throat that made me feel guilty.
zh_cn: 他耷拉着耳朵，喉间传来一阵低吼声：这我感觉到了一阵内疚。

source: Mom made a new shark for me, this time out of tin foil.
zh_cn: 妈妈又折了一条新的鲨鱼，这次用的是锡箔纸。

source: The shark lived happily in a large goldfish bowl.
zh_cn: 他快乐地生活在一个大金鱼缸里。

source: Laohu and I liked to sit next to the bowl to watch the tin foil shark chasing the goldfish, Laohu sticking his face up against the bowl on the other side so that I saw his eyes, magnified to the size of coffee cups, staring at me from across the bowl.
zh_cn: 阿虎和我喜欢坐在鱼缸边看着纸鲨鱼追赶金鱼。阿虎坐在鱼缸的另一边，昂着头紧贴着鱼缸，我总能看到他那被放大成咖啡杯大小的眼睛，正透过鱼缸盯着我看。

source: When I was ten, we moved to a new house across town.
zh_cn: 在我十岁时，我们家搬到了小镇的另一边。

source: Two of the women neighbors came by to welcome us.
zh_cn: 两个女邻居过来打招呼，以示欢迎。

source: Dad served them drinks and then apologized for having to run off to the utility company to straighten out the prior owner's bills.
zh_cn: 爸爸招待她们喝饮料，但他正急着要去物业公司结清上一任房主的账单。

source: "Make yourselves at home. My wife doesn't speak much English, so don't think she's being rude for not talking to you."
zh_cn: 走之前他对她们说：“随便坐吧，我太太不怎么会说英语，话不多，请别见怪。”

source: While I read in the dining room, Mom unpacked in the kitchen.
zh_cn: 当时我在餐厅看书，妈妈在厨房收拾东西。

source: The neighbors conversed in the living room, not trying to be particularly quiet.
zh_cn: 那两个邻居就在客厅里闲聊，也没觉得要轻声细语。

source: "He seems like a normal enough man. Why did he do that?"
zh_cn: “他看上去挺正常的呀，怎么想的啊？”

source: "Something about the mixing never seems right.
zh_cn: “混血的都有些毛病。

source: The child looks unfinished.
zh_cn: 看那小孩儿，就有点儿发育不全的样子。

source: Slanty eyes, white face. A little monster."
zh_cn: 蒙古眼、白皮肤，真像个小怪物。”

source: "Do you think he can speak English?"
zh_cn: “你说他会说英语吗？”

source: The women hushed.
zh_cn: 然后她们就不说话了。

source: After a while they came into the dining room.
zh_cn: 过了一会儿，她们走到餐厅来。

source: "Hello there! What's your name?"
zh_cn: “嗨，小家伙，你叫什么呀？”

source: "Jack," I said.
zh_cn: 我回答道：“杰克。”

source: "That doesn't sound very Chinesey."
zh_cn: “倒也不怎么像中国的嘛 。”

source: Mom came into the dining room then. She smiled at the women.
zh_cn: 之后妈妈也走到餐厅来，向她们示以微笑。

source: The three of them stood in a triangle around me, smiling and nodding at each other, with nothing to say, until Dad came back.
zh_cn: 她们三人围着我站成三角形，相互微笑点头致意，在爸爸回来之前再没有说一句话。

source: Mark, one of the neighborhood boys, came over with his Star Wars action figures.
zh_cn: 马克是邻家的小孩儿。有次，他拿着他的星战可动人偶欧比旺克诺比到我家来玩。

source: Obi-Wan Kenobi's lightsaber lit up and he could swing his arms and say, in a tinny voice, "Use the Force!"
zh_cn: 欧比旺的光剑发着光，而且还挥动着手臂发出尖叫声：“使用原力！”

source: I didn't think the figure looked much like the real Obi-Wan at all.
zh_cn: 不过我一点儿也不觉得那个人偶和真正的欧比旺有多像。

source: Together, we watched him repeat this performance five times on the coffee table. "Can he do anything else?" I asked.
zh_cn: 我和马克看着在他在咖啡桌上把这套动作做了五遍，然后我问马克说：“他能做点儿别的动作吗？”

source: Mark was annoyed by my question. "Look at all the details," he said.
zh_cn: 马克有些不高兴，说：“你好好看。”

source: I looked at the details. I wasn't sure what I was supposed to say.
zh_cn: 我于是盯着它仔细看，不知道要说些什么。

source: Mark was disappointed by my response. "Show me your toys."
zh_cn: 马克对我这个态度颇为无语：“那把你的玩具拿给我看看。”

source: I didn't have any toys except my paper menagerie.
zh_cn: 我除了那些纸动物，没有其他任何玩具。

source: I brought Laohu out from my bedroom.
zh_cn: 所以我从卧室把阿虎拿了出来。

source: By then he was very worn, patched all over with tape and glue, evidence of the years of repairs Mom and I had done on him.
zh_cn: 此时的阿虎看上去残破不堪，贴满了胶带和纸片：都是这几年来我和妈妈给他做的修修补补。

source: He was no longer as nimble and sure-footed as before.
zh_cn: 此时的他，也早已不复当年的敏捷和稳健。

source: I sat him down on the coffee table.
zh_cn: 我把他放到了咖啡桌上。

source: I could hear the skittering steps of the other animals behind in the hallway, timidly peeking into the living room.
zh_cn: 此时，我还听到走廊上传来其他动物们匆匆的脚步声，想必他们正小心翼翼地窥视着客厅吧。

source: "Xiao laohu," I said, and stopped.
zh_cn: 我对马克说：“xiǎo láo hǔ。”

source: I switched to English. "This is Tiger."
zh_cn: 说完我停了一下，又改用英语告诉他：“这是老虎。”

source: Cautiously, Laohu strode up and purred at Mark, sniffing his hands.
zh_cn: 阿虎谨慎地走上前去，嘴里发着咕噜声，嗅了嗅马克的手。

source: Mark examined the Christmas-wrap pattern of Laohu's skin. "That doesn't look like a tiger at all. Your Mom makes toys for you from trash?"
zh_cn: 马克打量着阿虎那礼盒包装纸的外表，说：“它一点儿也不像老虎，你妈是用垃圾给你做玩具吗？”

source: I had never thought of Laohu as trash.
zh_cn: 我从没把阿虎当成垃圾看。

source: But looking at him now, he was really just a piece of wrapping paper.
zh_cn: 但此时看看他，他确实只是一张包装纸。

source: Mark pushed Obi-Wan's head again. The lightsaber flashed; he moved his arms up and down. "Use the Force!"
zh_cn: 马克又打开了欧比旺头上的开关：光剑闪亮，欧比旺上下挥动着手臂，叫道：“使用原力！”

source: Laohu turned and pounced, knocking the plastic figure off the table.
zh_cn: 阿虎回过身就扑了过去，把这个塑料人偶撞下了桌。

source: It hit the floor and broke, and Obi-Wan's head rolled under the couch.
zh_cn: 它砸在地板上，摔坏了，欧比旺的头滚到了沙发底下。

source: "Rawwww," Laohu laughed. I joined him.
zh_cn: “嗷——”这是阿虎在笑，我也跟着笑了起来。

source: Mark punched me, hard.
zh_cn: 马克重重地给了我一拳。

source: "This was very expensive!
zh_cn: “它很贵的！

source: You can't even find it in the stores now.
zh_cn: 店里都没得卖了。

source: It probably cost more than what your dad paid for your mom!"
zh_cn: 它比你爸买你妈花的钱还贵！”

source: I stumbled and fell to the floor.
zh_cn: 我踉踉跄跄地跌坐在地上。

source: Laohu growled and leapt at Mark's face.
zh_cn: 阿虎吼了一声，冲着马克的脸就跳了过去。

source: Mark screamed, more out of fear and surprise than pain. Laohu was only made of paper, after all.
zh_cn: 马克尖叫着，倒不是被抓痛了，而是出于恐惧和惊讶：毕竟阿虎只是用纸做的啊。

source: Mark grabbed Laohu and his snarl was choked off as Mark crumpled him in his hand and tore him in half.
zh_cn: 马克一把抓住阿虎，只听见阿虎的吼叫一下遏然而止：此时他已被捏瘪撕成了两半。

source: He balled up the two pieces of paper and threw them at me. "Here's your stupid cheap Chinese garbage."
zh_cn: 马克把两块碎片捏成团砸了过来，骂道：“去你的中国贱垃圾！”

source: After Mark left, I spent a long time trying, without success, to tape together the pieces, smooth out the paper, and follow the creases to refold Laohu.
zh_cn: 马克走之后，我花了很长的时间，想把两片碎纸展平粘上，再沿折痕把阿虎折回来，但一切终归徒劳。

source: Slowly, the other animals came into the living room and gathered around us, me and the torn wrapping paper that used to be Laohu.
zh_cn: 其他动物陆续走进客厅，围着我、和那曾是阿虎的破包装纸身边。

source: My fight with Mark didn't end there.
zh_cn: 我和马克的恩怨还没有完。

source: Mark was popular at school. I never want to think again about the two weeks that followed.I came home that Friday at the end of the two weeks.
zh_cn: 马克在学校很吃香，那之后两周的事，我都不愿去回想。

source: "Xuexiao hao ma?" Mom asked.
zh_cn: 到第二个周五我到家时，妈妈问了句：“xué xiào hǎo ma？”

source: I said nothing and went to the bathroom.
zh_cn: 我什么也没说，径直走进浴室。

source: I looked into the mirror. I look nothing like her, nothing.
zh_cn: 我看着镜中的自己，默想 ：我一点也不像她，一点也不像。

source: At dinner I asked Dad, "Do I have a chink face?"
zh_cn: 晚餐时我问爸爸：“我长得像chink（中国佬） 吗？”

source: Dad put down his chopsticks.
zh_cn: 爸爸放下了筷子。

source: Even though I had never told him what happened in school, he seemed to understand.
zh_cn: 即使我没有跟他说我在学校碰到的事，他似乎也明白了。

source: He closed his eyes and rubbed the bridge of his nose. "No, you don't."
zh_cn: 他闭上眼，摸着鼻梁，说：“不，你不像。”

source: Mom looked at Dad, not understanding.
zh_cn: 妈妈看着爸爸，一脸的不解。

source: She looked back at me. "Sha jiao chink?"
zh_cn: 她又转过来对着我说：“shá jiào‘chink’？”

source: "English," I said. "Speak English."
zh_cn: “讲英语，”我说道，“讲英语啊。”

source: She tried. "What happen?"
zh_cn: 她试了试：“出什么事了？”

source: I pushed the chopsticks and the bowl before me away: stir-fried green peppers with five-spice beef. "We should eat American food."
zh_cn: 我推开碗筷和面前的青椒五香牛肉，说：“我们应该吃美餐。”

source: Dad tried to reason. "A lot of families cook Chinese sometimes."
zh_cn: 爸爸想做点辩解：“现在很多家庭时不时也会做顿中餐。”

source: "We are not other families." I looked at him.
zh_cn: 我看着他说：“我们又不是别人。”

source: Other families don't have moms who don't belong.
zh_cn: 别人才没有这么不入流的妈。

source: He looked away.
zh_cn: 他移开了视线。

source: And then he put a hand on Mom's shoulder. "I'll get you a cookbook."
zh_cn: 过了一会儿，他把手搭在妈妈的肩上，说：“我这几天给你带本烹饪书。”

source: Mom turned to me. "Bu haochi?"
zh_cn: 妈妈转向我，问：“bù hǎo chī？”

source: "English," I said, raising my voice. "Speak English."
zh_cn: “讲英语，”我提高了声音，“讲英语！”

source: Mom reached out to touch my forehead, feeling for my temperature. "Fashao la?"
zh_cn: 妈妈伸过手来贴在我额头上，感受我的体温 ：“fā shāo le？”

source: I brushed her hand away. "I'm fine. Speak English!" I was shouting.
zh_cn: 我一把拨开她的手，叫道：“我没事，讲英语啊！”

source: "Speak English to him," Dad said to Mom. "You knew this was going to happen some day.
zh_cn: “跟他说英语吧，”爸爸对妈妈说，“你知道这天早晚会来。

source: What did you expect?"
zh_cn: 你还想怎样？”

source: Mom dropped her hands to her side. She sat, looking from Dad to me, and back to Dad again.
zh_cn: 妈妈的手无力地垂了下去，弓着背坐着，目光由爸爸转向我，又回到爸爸那。

source: She tried to speak, stopped, and tried again, and stopped again.
zh_cn: 她试着开口，又开不了口；又想说，结果还是没说。

source: "You have to," Dad said. "I've been too easy on you. Jack needs to fit in."
zh_cn: “你必须得开口，”爸爸说，“我太惯着你了，但杰克还要进入社会啊。”
